# IKEA_Data_Wrangling

The goal of this notebook is to collect and prepare IKEA's metrics for its Econometric Model in Canada.

But before we getting into the gathering section, we need to load all libraries/packages used along this notebook.

In [1]:
import pandas as pd
import datetime

In [2]:
store_value = pd.read_excel('652.xlsx')
# Load auxiliary dataset
# Week Number mapping
week_df = pd.read_excel('week_number_for_use_on_scripts.xlsx')
#week_df['Date'] = pd.to_datetime(week_df['Date'])
week_df['Date'] = pd.to_datetime(week_df['Date'])
week_df.dtypes

FY                    object
Year                   int64
WeekNumber             int64
Date          datetime64[ns]
dtype: object

In [3]:
store_value = store_value.dropna(axis=0)

In [4]:
store_value.columns

Index(['Store', '2017 january - 2017 december', '2018 january',
       '2018 February -2018 August', '2018 September - 2018 December',
       '2019 January - 2019 June', '2019 July - 2019 October',
       '2019 October - 2019 December'],
      dtype='object')

In [5]:
store_value.dtypes

Store                             object
2017 january - 2017 december      object
2018 january                      object
2018 February -2018 August        object
2018 September - 2018 December    object
2019 January - 2019 June          object
2019 July - 2019 October          object
2019 October - 2019 December      object
dtype: object

The dataframe store_value is transposed with following function T

# Code

In [6]:
store_value = store_value.T.reset_index()

# Test

In [7]:
store_value.head(5)

,index,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,Store,003 Richmond,004 Ottawa,039 Montreal,040 Burlington,149 North York,216 Calgary,249 Winnipeg,256 Etobicoke,313 Coquitlam,349 Edmonton,372 Vaughan,414 Boucherville,529 Halifax,559 Quebec City
1,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
2,2018 january,99,99,99,99,99,99,99,99,99,99,99,99,99,99
3,2018 February -2018 August,99,29,99,99,99,99,99,99,99,99,99,99,99,99
4,2018 September - 2018 December,99,49,99,99,99,99,99,99,99,99,99,99,99,99

In [8]:
store_value.columns

Index(['index', 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='object')

To change the column names of data frame store_value from index columns to row 0

In [9]:
store_value.columns = store_value.iloc[0]
store_value.columns

Index(['Store', '003  Richmond', '004  Ottawa', '039  Montreal',
       '040  Burlington', '149  North York', '216  Calgary', '249  Winnipeg',
       '256  Etobicoke', '313  Coquitlam', '349  Edmonton', '372  Vaughan',
       '414  Boucherville', '529  Halifax', '559  Quebec City'],
      dtype='object', name=0)

Now,we want the new data frame from row 1 onwards only.

In [10]:
df_new = store_value[1:]

Renaming the column names from Store to month_range

In [11]:
df_new.rename(columns={'Store':'month_range'}, inplace=True)
df_new.head()

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4223: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(**kwargs)

,month_range,003 Richmond,004 Ottawa,039 Montreal,040 Burlington,149 North York,216 Calgary,249 Winnipeg,256 Etobicoke,313 Coquitlam,349 Edmonton,372 Vaughan,414 Boucherville,529 Halifax,559 Quebec City
1,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
2,2018 january,99,99,99,99,99,99,99,99,99,99,99,99,99,99
3,2018 February -2018 August,99,29,99,99,99,99,99,99,99,99,99,99,99,99
4,2018 September - 2018 December,99,49,99,99,99,99,99,99,99,99,99,99,99,99
5,2019 January - 2019 June,99,49,99,99,99,99,99,99,99,99,99,99,99,99

In [12]:
week_df.head(5)

     FY  Year  WeekNumber       Date
0  FY17  2016          35 2016-08-28
1  FY17  2016          36 2016-09-04
2  FY17  2016          37 2016-09-11
3  FY17  2016          38 2016-09-18
4  FY17  2016          39 2016-09-24

Here,the date column from week_df is filtered from year 2017

In [13]:
week_df = week_df[(week_df['Date']>='2017-01-01') & (week_df['Date']<='2019-08-25')]

In [14]:
week_df.head()

      FY  Year  WeekNumber       Date
18  FY17  2017           1 2017-01-01
19  FY17  2017           2 2017-01-08
20  FY17  2017           3 2017-01-15
21  FY17  2017           4 2017-01-22
22  FY17  2017           5 2017-01-29

The following function is defined to assign different month ranges to date column of week_df

# Code

In [15]:
def date_map(day):
    return datetime.datetime.strptime(day, "%Y-%m-%d")


def f(x):
    if (x >= date_map("2017-01-01")) & (x <= date_map("2017-12-31")):
         return "2017 january - 2017 december"
    elif(x >= date_map("2018-01-07")) & (x <= date_map("2018-01-28")):
         return "2018 january"
    elif(x >= date_map("2018-02-04")) & (x <= date_map("2018-08-26")):
         return "2018 February -2018 August"
    elif(x >= date_map("2018-09-02")) & (x <= date_map("2018-12-30")):        
         return "2018 September - 2018 December"
    elif(x >= date_map("2019-01-06")) & (x <= date_map("2019-06-23")):        
         return "2019 January - 2019 June"
    elif(x >= date_map("2019-06-23")) & (x <= date_map("2019-10-27")):        
         return "2019 July - 2019 October"
    elif(x >= date_map("2019-10-27")) & (x <= date_map("2019-12-29")):        
         return "2019 October - 2019 December"

In [16]:
week_df['month_range'] = week_df['Date'].apply(f)

# Test

In [17]:
week_df.head(5)

      FY  Year  WeekNumber       Date                   month_range
18  FY17  2017           1 2017-01-01  2017 january - 2017 december
19  FY17  2017           2 2017-01-08  2017 january - 2017 december
20  FY17  2017           3 2017-01-15  2017 january - 2017 december
21  FY17  2017           4 2017-01-22  2017 january - 2017 december
22  FY17  2017           5 2017-01-29  2017 january - 2017 december

In [18]:
week_df['month_range'][:2]

18    2017 january - 2017 december
19    2017 january - 2017 december
Name: month_range, dtype: object

The two dataframes are merged with left join applied on column 'month_range'

# Code

In [19]:
result_df=pd.merge(week_df, df_new, on='month_range', how='left')

# Test

In [20]:
result_df.head(10)

,FY,Year,WeekNumber,Date,month_range,003 Richmond,004 Ottawa,039 Montreal,040 Burlington,149 North York,216 Calgary,249 Winnipeg,256 Etobicoke,313 Coquitlam,349 Edmonton,372 Vaughan,414 Boucherville,529 Halifax,559 Quebec City
0,FY17,2017,1,2017-01-01,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
1,FY17,2017,2,2017-01-08,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
2,FY17,2017,3,2017-01-15,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
3,FY17,2017,4,2017-01-22,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
4,FY17,2017,5,2017-01-29,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
5,FY17,2017,6,2017-02-05,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
6,FY17,2017,7,2017-02-12,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
7,FY17,2017,8,2017-02-19,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
8,FY17,2017,9,2017-02-26,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99
9,FY17,2017,10,2017-03-05,2017 january - 2017 december,99,99,99,99,99,99,99,99,99,99,99,99,99,99

Renaming the column name from Date to week start

In [21]:
result_df.rename(columns={'Date':'Week Start'}, inplace=True)

# Clean
Droping the columns month_range as these are not required in result dataframe

In [22]:
df1=result_df.drop('month_range', axis=1)

Here the melt function is applied to melt the result_df data frame into 'Store' and 'Delivery Cost' columns

# Code

In [23]:
df_melt = df1.melt(id_vars = ['FY', 'Year','WeekNumber','Week Start'], var_name='Store', value_name='Delivery Cost')

# Test

In [24]:
df_melt.head()

     FY  Year  WeekNumber Week Start          Store Delivery Cost
0  FY17  2017           1 2017-01-01  003  Richmond            99
1  FY17  2017           2 2017-01-08  003  Richmond            99
2  FY17  2017           3 2017-01-15  003  Richmond            99
3  FY17  2017           4 2017-01-22  003  Richmond            99
4  FY17  2017           5 2017-01-29  003  Richmond            99

The 'Store' Column is divided into 'Store Number' and 'Store'

# Code

In [25]:
new = df_melt["Store"].str.split(" ", n = 1, expand = True)
df_melt["Store Number"]= new[0]   
# making separate last name column from new data frame 
df_melt["Store"]= new[1]  
df_melt['Week Start'] = pd.to_datetime(df_melt['Week Start']).dt.date
sequence = ['FY','Year','WeekNumber','Week Start','Store Number','Store','Delivery Cost']
result = df_melt.reindex(columns=sequence)

# Test

In [26]:
result.head()

     FY  Year  WeekNumber  Week Start Store Number      Store Delivery Cost
0  FY17  2017           1  2017-01-01          003   Richmond            99
1  FY17  2017           2  2017-01-08          003   Richmond            99
2  FY17  2017           3  2017-01-15          003   Richmond            99
3  FY17  2017           4  2017-01-22          003   Richmond            99
4  FY17  2017           5  2017-01-29          003   Richmond            99

The Output data is saved into Excel file

In [27]:
result.to_excel(r'M65_Delivery_Cost_Development_Over_Time.xlsx',index=False)